nxp-mcuxpresso/mcux-soc-svd/MCXW727A/MCXW727A_cm33_core0.xml
        <register>
          <name>RX_FRAME_FILTER</name>
          <description>RECEIVE FRAME FILTER</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x30F</resetValue>
          <resetMask>0xFF40FFFF</resetMask>
          <fields>
            <field>
              <name>BEACON_FT</name>
              <description>Beacon Frame Type Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BEACON_FT_0</name>
                  <description>reject all Beacon frames</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BEACON_FT_1</name>
                  <description>Beacon frame type enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATA_FT</name>
              <description>Data Frame Type Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA_FT_0</name>
                  <description>reject all Beacon frames</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_FT_1</name>
                  <description>Data frame type enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACK_FT</name>
              <description>Ack Frame Type Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACK_FT_0</name>
                  <description>reject all Acknowledge frames</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACK_FT_1</name>
                  <description>Acknowledge frame type enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMD_FT</name>
              <description>MAC Command Frame Type Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CMD_FT_0</name>
                  <description>reject all MAC Command frames</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_FT_1</name>
                  <description>MAC Command frame type enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LLDN_FT</name>
              <description>LLDN Frame Type Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LLDN_FT_0</name>
                  <description>reject all LLDN frames</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LLDN_FT_1</name>
                  <description>LLDN frame type enabled (Frame Type 4).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MULTIPURPOSE_FT</name>
              <description>Multipurpose Frame Type Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MULTIPURPOSE_FT_0</name>
                  <description>reject all Multipurpose frames</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULTIPURPOSE_FT_1</name>
                  <description>Multipurpose frame type enabled (Frame Type 5).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NS_FT</name>
              <description>&quot;Not Specified&quot; Frame Type Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NS_FT_0</name>
                  <description>reject all &quot;Not Specified&quot; frames</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NS_FT_1</name>
                  <description>Not-specified (reserved) frame type enabled. Applies to Frame Type 6. No packet filtering is performed, except for frame length checking (FrameLength&gt;=5 and FrameLength&lt;=127). No AUTOACK is transmitted for this Frame Type</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTENDED_FT</name>
              <description>Extended Frame Type Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXTENDED_FT_0</name>
                  <description>reject all Extended frames</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTENDED_FT_1</name>
                  <description>Extended frame type enabled (Frame Type 7).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRM_VER_FILTER</name>
              <description>Frame Version selector.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACTIVE_PROMISCUOUS</name>
              <description>Active Promiscuous</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE_PROMISCUOUS_0</name>
                  <description>normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE_PROMISCUOUS_1</name>
                  <description>Provide Data Indication on all received packets under the same rules which apply in PROMISCUOUS mode, however acknowledge those packets under rules which apply in non-PROMISCUOUS mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTENDED_FCS_CHK</name>
              <description>Verify FCS on Frame Type Extended</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXTENDED_FCS_CHK_0</name>
                  <description>Packet Processor will not check FCS for Frame Type EXTENDED (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTENDED_FCS_CHK_1</name>
                  <description>Packet Processor will check FCS at end-of-packet based on packet length derived from PHR, for Frame Type EXTENDED</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FV2_BEACON_RECD</name>
              <description>Frame Version 2 Beacon Packet Received</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FV2_BEACON_RECD_0</name>
                  <description>The last packet received was not Frame Type Beacon with Frame Version 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FV2_BEACON_RECD_1</name>
                  <description>The last packet received was Frame Type Beacon with Frame Version 2, and FRM_VER_FILTER[2]=1 to allow such packets</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FV2_DATA_RECD</name>
              <description>Frame Version 2 Data Packet Received</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FV2_DATA_RECD_0</name>
                  <description>The last packet received was not Frame Type Data with Frame Version 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FV2_DATA_RECD_1</name>
                  <description>The last packet received was Frame Type Data with Frame Version 2, and FRM_VER_FILTER[2]=1 to allow such packets</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FV2_ACK_RECD</name>
              <description>Frame Version 2 Acknowledge Packet Received</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FV2_ACK_RECD_0</name>
                  <description>The last packet received was not Frame Type Ack with Frame Version 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FV2_ACK_RECD_1</name>
                  <description>The last packet received was Frame Type Ack with Frame Version 2, and FRM_VER_FILTER[2]=1 to allow such packets</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FV2_CMD_RECD</name>
              <description>Frame Version 2 MAC Command Packet Received</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FV2_CMD_RECD_0</name>
                  <description>The last packet received was not Frame Type MAC Command with Frame Version 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FV2_CMD_RECD_1</name>
                  <description>The last packet received was Frame Type MAC Command with Frame Version 2, and FRM_VER_FILTER[2]=1 to allow such packets</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LLDN_RECD</name>
              <description>LLDN Packet Received</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LLDN_RECD_0</name>
                  <description>The last packet received was not Frame Type LLDN</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LLDN_RECD_1</name>
                  <description>The last packet received was Frame Type LLDN, and LLDN_FT=1 to allow such packets.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MULTIPURPOSE_RECD</name>
              <description>Multipurpose Packet Received</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MULTIPURPOSE_RECD_0</name>
                  <description>last packet received was not Frame Type MULTIPURPOSE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULTIPURPOSE_RECD_1</name>
                  <description>The last packet received was Frame Type MULTIPURPOSE, and MULTIPURPOSE_FT=1 to allow such packets.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTENDED_RECD</name>
              <description>Extended Packet Received</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXTENDED_RECD_0</name>
                  <description>The last packet received was not Frame Type EXTENDED</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTENDED_RECD_1</name>
                  <description>The last packet received was Frame Type EXTENDED, and EXTENDED_FT=1 to allow such packets.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCA_LQI_CTRL</name>
          <description>CCA AND LQI CONTROL</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x866004B</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CCA1_THRESH</name>
              <description>CCA Mode 1 Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LQI_OFFSET_COMP</name>
              <description>LQI Offset Compensation</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIMUL_CCA_RX</name>
              <description>Simultaneous CCA and Receive Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIMUL_CCA_RX_0</name>
                  <description>Packets can't be received during CCA measurement</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIMUL_CCA_RX_1</name>
                  <description>Packet reception is enabled during CCA measurement if preamble and SFD are detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCA3_AND_NOT_OR</name>
              <description>CCA Mode 3 AND not OR</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCA3_AND_NOT_OR_0</name>
                  <description>CCA1 or CCA2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCA3_AND_NOT_OR_1</name>
                  <description>CCA1 and CCA2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCA2_CTRL</name>
          <description>CCA2 CONTROL</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8230</resetValue>
          <resetMask>0xFFFFFFF0</resetMask>
          <fields>
            <field>
              <name>CCA2_NUM_CORR_PEAKS</name>
              <description>CCA Mode 2 Number of Correlation Peaks Detected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CCA2_MIN_NUM_CORR_TH</name>
              <description>CCA Mode 2 Threshold Number of Correlation Peaks</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCA2_CORR_THRESH</name>
              <description>CCA Mode 2 Correlation Threshold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSM_CTRL</name>
          <description>DSM CONTROL</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ZIGBEE_SLEEP_REQUEST</name>
              <description>802.15.4 Deep Sleep Mode Request for Manual DSM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MACSHORTADDRS1</name>
          <description>MAC SHORT ADDRESS FOR PAN1</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MACPANID1</name>
              <description>MAC PAN ID for PAN1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MACSHORTADDRS1</name>
              <description>MAC SHORT ADDRESS for PAN1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MACLONGADDRS1_LSB</name>
          <description>MAC LONG ADDRESS 1 LSB</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MACLONGADDRS1_LSB</name>
              <description>MAC LONG ADDRESS for PAN1 LSB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MACLONGADDRS1_MSB</name>
          <description>MAC LONG ADDRESS 1 MSB</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MACLONGADDRS1_MSB</name>
              <description>MAC LONG ADDRESS for PAN1 MSB</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
