nxp-mcuxpresso/mcux-soc-svd/MCXW727A/MCXW727A_cm33_core0.xml
        <register>
          <name>COEX_CTRL</name>
          <description>COEXISTENCE CONTROL</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x304</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COEX_EN</name>
              <description>Coexistence Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COEX_EN_0</name>
                  <description>Coexistence function is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_EN_1</name>
                  <description>Coexistence function is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COEX_REQ_DELAY_EN</name>
              <description>Coexistence Request Delay Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COEX_REQ_DELAY_EN_0</name>
                  <description>arb_request is not delayed during R sequence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_REQ_DELAY_EN_1</name>
                  <description>arb_request is delayed until preamble is detected during R sequence.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COEX_REQ_ON_PD</name>
              <description>Coexistence Request on Preamble detected</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COEX_REQ_ON_PD_0</name>
                  <description>arb_request is delayed until SFD is detected during R sequence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_REQ_ON_PD_1</name>
                  <description>arb_request is delayed until preamble is detected during R sequence.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COEX_TIMEOUT_MSK</name>
              <description>Coexistence Timeout Interrupt Mask bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COEX_TIMEOUT_MSK_0</name>
                  <description>allows interrupt when coexistence timeout</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_TIMEOUT_MSK_1</name>
                  <description>Interrupt generation is disabled, but a COEX_TIMEOUT_IRQ flag can be set</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COEX_TIMEOUT_IRQ</name>
              <description>Coexistence Timeout Interrupt</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>COEX_TIMEOUT</name>
              <description>Coexistence timeout value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COEX_PRIORITY</name>
          <description>COEXISTENCE PRIORITY</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRIORITY_T</name>
              <description>PRIORITY_T</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIORITY_R_PRE</name>
              <description>PRIORITY_R_PRE</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIORITY_R_PKT</name>
              <description>PRIORITY_R_PKT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIORITY_TACK</name>
              <description>PRIORITY_TACK</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIORITY_CCA</name>
              <description>PRIORITY_CCA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIORITY_CCCA</name>
              <description>PRIORITY_CCCA</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIORITY_CTX</name>
              <description>PRIORITY_CT</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIORITY_RACK_PRE</name>
              <description>PRIORITY_RACK_PRE</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIORITY_RACK_PKT</name>
              <description>PRIORITY_RACK_PKT</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIORITY_OVRD</name>
              <description>PRIORITY_OVRD</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIORITY_OVRD_EN</name>
              <description>PRIORITY_OVRD_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRIORITY_OVRD_EN_0</name>
                  <description>Disable overriding PRIORITY value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRIORITY_OVRD_EN_1</name>
                  <description>Enable overriding PRIORITY value.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENHACK_CTRL0</name>
          <description>ENHACK_CTRL 0</description>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFF00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENHACK_EN</name>
              <description>Enhanced Acknowledgment Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENHACK_EN_0</name>
                  <description>Enhanced acknowledgment is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENHACK_EN_1</name>
                  <description>Enhanced acknowledgment is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW_LEN_RDY</name>
              <description>Software enhanced acknowledgment frame Length field ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SW_LEN_RDY_0</name>
                  <description>Software enhanced acknowledgment frame Length field is not ready.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_LEN_RDY_1</name>
                  <description>Software enhanced acknowledgment frame Length field is ready in RAM</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW_HIE_RDY</name>
              <description>Software enhanced acknowledgment frame HIE field ready</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SW_HIE_RDY_0</name>
                  <description>Software enhanced acknowledgment frame HIE field is not ready.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_HIE_RDY_1</name>
                  <description>Software enhanced acknowledgment frame HIE field is ready in RAM</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMPTY_SECURITY_ENABLED_OVRD</name>
              <description>Override value of Security Enabled field in Empty Enhanced Acknowledgment</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMPTY_SRC_ADDR_MODE</name>
              <description>Source Address Mode field in Empty Enhanced Acknowledgment</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_MHR_LENGTH</name>
              <description>Software calculated MHR(excludes the HIE field) Length in bytes.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HW_FRAME_PENDING</name>
              <description>Hardware calculated Frame Pending field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EMPTY_SECURITY_ENABLED_OVRD_EN</name>
              <description>Override enable of Security Enabled field in Empty Enhanced Acknowledgment</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMPTY_SECURITY_ENABLED_OVRD_EN_0</name>
                  <description>Security Enabled field in Empty Enhanced Acknowledgment frame is 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMPTY_SECURITY_ENABLED_OVRD_EN_1</name>
                  <description>Security Enabled field in Empty Enhanced Acknowledgment frame is from EMPTY_SECURITY_ENABLED_OVRD.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE_HW_MODE7_8</name>
              <description>Enable autoack for frame version 2 extended addressing modes</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE_HW_MODE7_8_0</name>
                  <description>Disable autoack for frame version 2 extended addressing modes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_HW_MODE7_8_1</name>
                  <description>Enable autoack for frame version 2extended addressing modes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCE_ACK_ENABLE_FOR_FV2</name>
              <description>Force autoack for all frame version 2 packets</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCE_ACK_ENABLE_FOR_FV2_0</name>
                  <description>Normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE_ACK_ENABLE_FOR_FV2_1</name>
                  <description>Force autoack for all frame version2 packets</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACK_ABORT_MSK</name>
              <description>Enhanced Acknowledgment Abort IRQ Mask bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACK_ABORT_MSK_0</name>
                  <description>allows interrupt when HIE field is not ready by software.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACK_ABORT_MSK_1</name>
                  <description>Interrupt generation is disabled, but a ACK_ABORT_IRQ flag can be set</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACK_ABORT_IRQ</name>
              <description>Enhanced Acknowledgment Abort IRQ</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>EMPTY_ACK_MSK</name>
              <description>Empty Enhanced Acknowledgment IRQ Mask bit</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMPTY_ACK_MSK_0</name>
                  <description>allows interrupt when Empty Enhanced Acknowledgment</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMPTY_ACK_MSK_1</name>
                  <description>Interrupt generation is disabled, but a EMPTY_ACK_IRQ flag can be set</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMPTY_ACK_IRQ</name>
              <description>Empty Enhanced Acknowledgment IRQ</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RECYC_MSK</name>
              <description>Recycle IRQ Mask bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RECYC_MSK_0</name>
                  <description>allows interrupt when recycle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RECYC_MSK_1</name>
                  <description>Interrupt generation is disabled, but a RECYC_IRQ flag can be set</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RECYC_IRQ</name>
              <description>Recycle IRQ</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
