nxp-mcuxpresso/mcux-soc-svd/MCXW727A/MCXW727A_cm33_core0.xml
        <register>
          <name>COEX_PRIORITY</name>
          <description>COEXISTENCE PRIORITY</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRIORITY_T</name>
              <description>PRIORITY_T</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIORITY_R_PRE</name>
              <description>PRIORITY_R_PRE</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIORITY_R_PKT</name>
              <description>PRIORITY_R_PKT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIORITY_TACK</name>
              <description>PRIORITY_TACK</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIORITY_CCA</name>
              <description>PRIORITY_CCA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIORITY_CTX</name>
              <description>PRIORITY_CT</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIORITY_RACK_PRE</name>
              <description>PRIORITY_RACK_PRE</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIORITY_RACK_PKT</name>
              <description>PRIORITY_RACK_PKT</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIORITY_OVRD</name>
              <description>PRIORITY_OVRD</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRIORITY_OVRD_EN</name>
              <description>PRIORITY_OVRD_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRIORITY_OVRD_EN_0</name>
                  <description>Disable overriding PRIORITY value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRIORITY_OVRD_EN_1</name>
                  <description>Enable overriding PRIORITY value.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ_CTRL2</name>
          <description>IRQ CONTROL 2</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ARB_GRANT_DEASSERTION_IRQ</name>
              <description>arb_grant Deassertion IRQ</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARB_GRANT_DEASSERTION_IRQ_0</name>
                  <description>An arb_grant Deassertion Interrupt has not occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARB_GRANT_DEASSERTION_IRQ_1</name>
                  <description>An arb_grant Deassertion Interrupt has occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COEX_TIMEOUT_IRQ</name>
              <description>Coexistence Timeout Interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>EVENT_TIMER_OVER_FLOW_IRQ</name>
              <description>Event Timer Overflow Interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>WL_FAIL_IRQ</name>
              <description>White List Check Fail Interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>DIRECT_ID_FAIL_IRQ</name>
              <description>Direct Case Check Fail Interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>PEER_RPA_FAIL_IRQ</name>
              <description>Peer RPA Check Fail Interrupt</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>LOCAL_RPA_FAIL_IRQ</name>
              <description>Local RPA Check Fail Interrupt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ARB_GRANT_DEASSERTION_IRQ_EN</name>
              <description>arb_grant Deassertion Interrupt enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARB_GRANT_DEASSERTION_IRQ_EN_0</name>
                  <description>An arb_grant deassertion event will set the ARB_GRANT_DEASSERTION_IRQ status bit, but no interrupt is not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARB_GRANT_DEASSERTION_IRQ_EN_1</name>
                  <description>allows arb_grant deassertion event to generate an interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COEX_TIMEOUT_IRQ_EN</name>
              <description>Coexistence Timeout Interrupt enable bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COEX_TIMEOUT_IRQ_EN_0</name>
                  <description>Interrupt generation is disabled, but a COEX_TIMEOUT_IRQ flag can be set</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_TIMEOUT_IRQ_EN_1</name>
                  <description>allows interrupt when coexistence timeout</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVENT_TIMER_OVER_FLOW_IRQ_EN</name>
              <description>Event Timer Overflow Interrupt enable bit</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EVENT_TIMER_OVER_FLOW_IRQ_EN_0</name>
                  <description>Interrupt generation is disabled, but an EVENT_TIMER_OVER_FLOW_IRQ flag can be set</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVENT_TIMER_OVER_FLOW_IRQ_EN_1</name>
                  <description>allows interrupt when Event Timer overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WL_FAIL_IRQ_EN</name>
              <description>no description available</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>WL_FAIL Interrupt is not enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASSERTED</name>
                  <description>WL_FAIL Interrupt is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIRECT_ID_FAIL_IRQ_EN</name>
              <description>no description available</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>DIRECT_ID_FAIL Interrupt is not enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASSERTED</name>
                  <description>DIRECT_ID_FAIL Interrupt is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEER_RPA_FAIL_IRQ_EN</name>
              <description>no description available</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>PEER_RPA_FAIL Interrupt is not enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASSERTED</name>
                  <description>PEER_RPA_FAIL Interrupt is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCAL_RPA_FAIL_IRQ_EN</name>
              <description>no description available</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>LOCAL_RPA_FAIL Interrupt is not enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASSERTED</name>
                  <description>LOCAL_RPA_FAIL Interrupt is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
