nxp-mcuxpresso/mcux-soc-svd/MCXW727A/MCXW727A_cm33_core0.xml
        <register>
          <name>COEX_CTRL</name>
          <description>COEXISTENCE CONTROL</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RF_NOT_ALLOWED_EN</name>
              <description>RF_NOT_ALLOWED PER-LINK-LAYER ENABLE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RF_NOT_ALLOWED_ASSERTED</name>
              <description>RF_NOT_ALLOWED_ASSERTED</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RF_NOT_ALLOWED_ASSERTED_0</name>
                  <description>Assertion on RF_NOT_ALLOWED has not occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RF_NOT_ALLOWED_ASSERTED_1</name>
                  <description>Assertion on RF_NOT_ALLOWED has occurred since the last time this bit was cleared</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RF_NOT_ALLOWED</name>
              <description>RF_NOT_ALLOWED</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RF_NOT_ALLOWED_OVRD</name>
              <description>RF_NOT_ALLOWED Override</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RF_NOT_ALLOWED_OVRD_EN</name>
              <description>RF_NOT_ALLOWED Override Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RF_NOT_ALLOWED_OVRD_EN_0</name>
                  <description>RF_NALLOWED Override Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RF_NOT_ALLOWED_OVRD_EN_1</name>
                  <description>RF_NALLOWED Override Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RF_NALLOWED_INV</name>
              <description>RF_NALLOWED Invert</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RF_NALLOWED_INV_0</name>
                  <description>rf_nallowed is not inverted.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RF_NALLOWED_INV_1</name>
                  <description>rf_nallowed is inverted.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RF_ACTIVE_INV</name>
              <description>RF_ACTIVE Invert</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RF_ACTIVE_INV_0</name>
                  <description>rf_active is not inverted.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RF_ACTIVE_INV_1</name>
                  <description>rf_active is inverted.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RF_PRIORITY_INV</name>
              <description>RF_PRIORITY Invert</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RF_PRIORITY_INV_0</name>
                  <description>rf_priority[1] is not inverted.</description>
                  <value>#0x</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RF_PRIORITY_INV_0</name>
                  <description>rf_priority[0] is not inverted.</description>
                  <value>#x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RF_PRIORITY_INV_1</name>
                  <description>rf_priority[0] is inverted.</description>
                  <value>#x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RF_PRIORITY_INV_2</name>
                  <description>rf_priority[1] is inverted.</description>
                  <value>#1x</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RF_STATUS_INV</name>
              <description>RF_STATUS Invert</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RF_STATUS_INV_0</name>
                  <description>rf_status is not inverted.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RF_STATUS_INV_1</name>
                  <description>rf_status is inverted.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COEX_SEL</name>
              <description>COEX_SEL</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COEX_SEL_0</name>
                  <description>Select coexistence signals from LL.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_SEL_1</name>
                  <description>Select coexistence signals from TSM.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UID_MSB</name>
          <description>Radio Control Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RADIO_UID_MSB</name>
              <description>The most signficant 8bits of the 40bit Radio UID.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UID_LSB</name>
          <description>Radio Control Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RADIO_UID_LSB</name>
              <description>The least signficant 32bits of the 40bit Radio UID.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_CTRL</name>
          <description>PACKET RAM Control Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PB_PROTECT</name>
              <description>PB_PROTECT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PB_PROTECT_0</name>
                  <description>Incoming receive data can overwrite the existing contents of the RX section of the Packet Buffer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PB_PROTECT_1</name>
                  <description>Incoming receive data is been blocked from overwriting the existing contents of the RX section of the Packet Buffer.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_PHY_CTRL</name>
          <description>BLE PHY Interface Control Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF0F1222</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTE_AVG_SAMP_SEL</name>
              <description>Sampling select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_START_OFFSET_1M</name>
              <description>Start sending Rx data to NBU after a programmable number of symbols are received from PHY - 1M</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_START_OFFSET_2M</name>
              <description>Start sending Rx data to NBU after a programmable number of symbols are received from PHY - 2M</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_START_OFFSET_LR</name>
              <description>Start sending Rx data to NBU after a programmable number of symbols are received from PHY - LR</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GUARD_TIME_1M</name>
              <description>Guard time offset for 1M</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GUARD_TIME_2M</name>
              <description>Guard time offset for 2M</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AVG_IQ_DISABLE</name>
              <description>Disable IQ sample averaging</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTE_SINGLE_BUF</name>
              <description>Config for using single buffer for Rx data and CTE samples</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DTEST_CTRL</name>
          <description>DTEST Control register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DTEST_PAGE</name>
              <description>DTEST PAGE Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTEST_EN</name>
              <description>DTEST_EN control</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DTEST_EN_0</name>
                  <description>disable dtest feature</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_EN_1</name>
                  <description>enable dtest feature</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTEST_OUT_REG_EN</name>
              <description>Enable/Disable register dtest signal</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DTEST_OUT_REG_EN_0</name>
                  <description>output dtest signal directly</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTEST_OUT_REG_EN_1</name>
                  <description>output dtest signal after registered</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAW_MODE_I</name>
              <description>Select rx_dig_i as DTEST RX_IQ page</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAW_MODE_Q</name>
              <description>Select rx_dig_q as DTEST RX_IQ page</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTEST_SHIFT</name>
              <description>DTEST shift control</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
